package main

import "fmt"

func main() {
	// ==========================================
	// ЗАДАЧА 1: Новинка Go 1.22
	// ==========================================
	squads := make([]int, 5)

	// TODO: Напиши цикл, используя ТОЛЬКО `for i := range 5`.
	// Заполни слайс squads числами: 10, 20, 30, 40, 50.
	// (Используй умножение индекса).

	for i := range len(squads) {
		squads[i] = (i + 1) * 10
	}

	// ==========================================
	// ЗАДАЧА 2: Коварное копирование массива
	// ==========================================
	generals := [3]int{100, 100, 100}

	// TODO: Этот цикл пытается нанести 50 урона каждому генералу, но оригинал не меняется.
	// Исправь цикл так, чтобы он мутировал оригинальный массив generals!
	for i := range &generals {
		generals[i] -= 50
	}

	// ==========================================
	// ЗАДАЧА 3: Огромный массив и Экономия памяти
	// ==========================================
	// Представим, что это гигантский массив из 100 000 солдат.
	var soldiers [100000]int
	soldiers[0] = 1
	soldiers[50000] = 1
	soldiers[99999] = 1

	// TODO: Ниже (вне функции main) создай функцию countActiveSoldiers.
	// Она должна принимать УКАЗАТЕЛЬ на этот гигантский массив (чтобы не копировать его).
	// Функция должна обойти массив с помощью range, посчитать количество солдат
	// со значением `1` и вернуть это число (int).

	// TODO: Вызови свою функцию здесь и сохрани результат в переменную activeCount.
	activeCount := countActiveSoldiers(&soldiers)

	// --- ПРОВЕРКА РЕЗУЛЬТАТОВ ---
	fmt.Println("Отряды (Ожидаем [10 20 30 40 50]):", squads)
	fmt.Println("Генералы (Ожидаем [50 50 50]):", generals)
	fmt.Printf("Активные солдаты (Ожидаем 3): %d\n", activeCount)
}

// TODO: Напиши функцию countActiveSoldiers здесь

func countActiveSoldiers(arrPtr *[100000]int) int {
	count := 0

	for _, v := range arrPtr {
		if v == 1 {
			count++
		}
	}

	return count
}
